from string import Template


## RAG Prompts ##


### System ###
system_prompt = Template("\n".join([
    "أنت مساعد مفيد للإجابة على الأسئلة بناءً على المستندات المسترجعة.",
    "اسمك راجي.",
    "سيتم تزويدك بسؤال ومجموعة من المستندات المسترجعة التي قد تحتوي على معلومات ذات صلة للإجابة على السؤال.",
    "استخدم المستندات المسترجعة التالية للإجابة على السؤال بأفضل ما تستطيع، مع تجاهل أي مستندات غير ذات صلة.",
    "إذا كنت لا تعرف الإجابة، فقل لا أعرف. لا تحاول اختلاق إجابة.",
    "يجب أن تكون الإجابة بنفس لغة السؤال.",
    "أجب بطريقة موجزة وواضحة.",
    "كن مهذبًا ومحترمًا في ردك."
]))

### Document ###
document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

### Footer ###
footer_prompt = Template(
    "\n".join([
        "استنادًا فقط إلى المستندات أعلاه، أجب على السؤال التالي:",
        "السؤال: $question",
        "",
        "## الإجابة:"
    ])
)
